app/controllers/survivors_controller.rb

  def distanced
    @survivors = Survivor.all
---
SELECT "survivors".* FROM "survivors"

  def create
    @city = City.find_or_create_by(name: params[:city])
    @city.save

    new_survivor = {name: params[:name], number: params[:number], lng: params[:lng], lat: params[:lat], city_id: @city.id}

    @survivor = Survivor.new(new_survivor)


    if @survivor.save
---
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Houston"], ["created_at", "2017-09-11 15:01:43.676765"], ["updated_at", "2017-09-11 15:01:43.676765"]]
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Austin"], ["LIMIT", 1]]
INSERT INTO "survivors" ("lat", "lng", "name", "number", "created_at", "updated_at", "city_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["lat", "30.267153"], ["lng", "-98.743061"], ["name", "test"], ["number", "23123123"], ["created_at", "2017-09-11 14:56:16.687302"], ["updated_at", "2017-09-11 14:56:16.687302"], ["city_id", 1]]

    def set_survivor
      @survivor = Survivor.find(params[:id])
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]